
import './footerPages.css'
import certificationImage from '../assets/certificationImage.png'
const Certification = () => {
    return (
        <div className='certification'>
             <h1>Сертифікація</h1>
                <div className='certirfication__img'>
                    <img src={certificationImage}></img>
                </div>
               
                <div className='certification__text'>
                    <p>
                    20 вересня 2016 року набув чинності розділ <b>VII Закону України «Про основні принципи та вимоги до безпечності та якості харчових продуктів»</b>, 
                    який регламентує гігієнічні вимоги щодо поводження з харчовими продуктами. Обовʼязково ознайомтеся із даною правовою базою.
                    </p>
                    <p>
                        Ми дуже серйозно ставимося до вимог законодавства, тому просимо Шефів підходити до цього питання також із усією відповідальністю.
                    </p>
                    <p>
                        При приготуванні страв, завжди треба слідкувати за чистотою поверхонь, посуду та якістю харчових продуктів. 
                        Необхідно дотримуватися температурного режиму при зберіганні готових страв, товарного сусідства та герметичністю ємностей для страв.
                    </p>
                    <p>
                        Кожен Шеф несе персональну відповідальність за той товар, який отримує клієнт. У будь-якому разі, жоден Шеф не зацікавлений у тому, 
                        щоб псувати свою репутацію та бути видаленим із платформи. Вся серйозність справи стимулює Шефа на вдосконалення себе та своїх підходів у приготуванні страв.
                    </p>
                    <p>
                        Існує безліч платформ, де кожен бажаючий може отримати сертифікат щодо поводження із харчовими продуктами. 
                        Таким чином, Шеф показує те, що для нього дуже важливо розвиватися та вдосконалюватися.
                    </p>
                    <p>
                        Прикладом є веб-ресурс <a href='https://sanfood.biz/category/haccp/'>https://sanfood.biz/category/haccp/</a> де можна отримати сертифікат на один або декілька запропонованих напрямків.
                    </p>
                </div>
        </div>
    )
}

export default Certification