

import { useEffect } from 'react'
import './TermOfUse.css'
const PrivatePolicy = () => {
    useEffect(() => {
            window.scrollTo(0, 0)
          }, [])
    return (
        <div className="terms">
            <h1>Політика конфіденційності</h1>
            <div className="terms__content" inert>
                <p>Ласкаво просимо на веб-сайт homechef.com.ua (далі – «Сайт») компанії Home Chef, (далі –
                    «Chef», «ми», «нас» або «наш»). Home Chef надає онлайн-платформу, на якій Продавці
                    (визначені нижче) можуть перераховувати, пропонувати, продавати та доставляти готові страви
                    та/або напівготові широкому загалу, а клієнти можуть переглядати та купувати запропоновану
                    продукцію на пряму у Продавців (разом, включаючи Сайт і будь-які пов’язані мобільні
                    програми, «Сервіс»).
                </p>
                <p>
                    У цій Політиці конфіденційності пояснюється, яку інформацію ми збираємо, як ми
                    використовуємо та надаємо доступ до цих даних, а також ваш вибір щодо наших методів
                    обробки даних.
                </p>
                <p>
                    Перш ніж користуватися Сервісом або надсилати будь-яку інформацію Chef, уважно
                    ознайомтеся з цією Політикою конфіденційності та зв’яжіться з нами за адресою
                    homechef.reply@gmail.com, якщо у вас виникнуть запитання. Користуючись Сервісом, ви
                    погоджуєтеся з нашими Умовами обслуговування та правилами, описаними в цій Політиці
                    конфіденційності. Якщо ви не згодні з цією Політикою конфіденційності та нашими Умовами
                    надання послуг, будь ласка, не заходьте на Сайт і не використовуйте Сервіс іншим чином.
                </p>

                <h2>1. ІНФОРМАЦІЯ, ЯКУ МИ ЗБИРАЄМО</h2>
                <p>
                    Ми збираємо інформацію таким чином:
                </p>
                <p>
                    Інформація, яку ви надаєте: ми збираємо інформацію, яку ви надаєте Chef, коли заповнюєте
                    або оновлюєте обов’язкову та необов’язкову інформацію про профіль під час реєстрації та
                    використання Сервісу, зв’язуєтеся з нами електронною поштою, заповнюєте контактну форму
                    на Сервісі; здійснення покупки; участь у рекламній акції. Інформація, зібрана під час цих
                    взаємодій, може відрізнятися залежно від того, чим ви вирішите поділитися з нами, але
                    зазвичай вона включатиме ім’я, адресу електронної пошти, номер телефону, облікові дані
                    облікового запису, демографічні дані (такі як стать та країна), Вашу адресу доставки, інші дані
                    профілю (такі як ваші вподобання), зміст будь-якого повідомлення, яке ви надсилаєте нам або
                    відгуки, які ви надсилаєте про страви Продавців, які можуть бути публічно опубліковані в
                    Сервісі.
                </p>
                <p>
                    Інформація, яку ми збираємо через наші сторінки в соціальних мережах і чат-ботів: у нас є
                    сторінки в таких соціальних мережах та/або месенджерах, як Instagram, Telegram і Facebook
                    («Соціальні мережі»). Коли ви взаємодієте з нашими сторінками в соціальних мережах
                    (наприклад, через наш чат-бот у будь-якому із доступних месенджерів), ми збиратимемо
                    інформацію, яку ви нам надаєте, наприклад ваші контактні дані. Крім того, якщо ви публічно
                    згадуєте наш Сервіс у соціальних мережах (наприклад, використовуючи хештег, пов’язаний із
                    Шефом), ми можемо використовувати ваше посилання на наш Сервіс. Крім того, компанії, які
                    розміщують наші сторінки в соціальних мережах, можуть надавати нам сукупну інформацію та
                    аналітику щодо використання наших сторінок у соціальних мережах.

                </p>
                <p>
                    Інформація, яку ми отримуємо автоматично під час використання вами Послуги: коли ви
                    відвідуєте, використовуєте та взаємодієте з Послугою, ми можемо отримати певну інформацію
                    про ваш візит, використання або взаємодію. Наприклад, ми можемо відстежувати кількість
                    людей, які відвідують Сервіс, години пік відвідувань, які сторінки ви відвідуєте, які посилання
                    натискаєте, який текст вводите, як ваша миша переміщується Сервісом, домени, на які ви
                    заходите з (наприклад, google.com, facebook.com тощо) і які браузери ви використовуєте для
                    доступу до Служби (наприклад, Google Chrome, Firefox, Microsoft Internet Explorer тощо),
                    широку географічну інформацію (наприклад, місцезнаходження, отримане з IP-адреса або дані,
                    що вказують на рівень міста чи поштового індексу) і точні дані про місцезнаходження
                    (наприклад, дані про широту/довготу, коли ви вводите свою адресу для доставки їжі), а також
                    шаблони навігації. Зокрема, така інформація створюється та автоматично реєструється в наших
                    системах:

                </p>
                <p>
                    • Дані журналу: інформація, яку ваш браузер автоматично надсилає, коли ви відвідуєте Сайт
                    («дані журналу»). Дані журналу включають вашу адресу Інтернет-протоколу, тип і
                    налаштування браузера, дату та час вашого запиту та те, як ви взаємодіяли з Сайтом.
                </p>
                <p>
                    • Інформація про пристрій: містить назву пристрою, операційну систему, інтернет-провайдера,
                    регіональні та мовні налаштування вашого пристрою, ідентифікатори пристрою (наприклад,
                    IP-адресу) і браузер, який ви використовуєте. Зібрана інформація може залежати від типу
                    пристрою, який ви використовуєте, і його налаштувань.
                </p>
                <p>
                    • Інформація про використання: ми збираємо інформацію про те, як ви використовуєте наш
                    Сервіс, наприклад типи вмісту, який ви переглядаєте або з яким взаємодієте, функції, якими ви
                    користуєтеся, дії, які ви виконуєте (зокрема страви, які ви переглядаєте та купуєте), електронні
                    листи, які ви переглядаєте, а також час, частоту та тривалість вашої діяльності.

                </p>
                <p>
                    Інформація, яку ми збираємо, якщо ви користуєтеся Сервісом як Продавець: якщо ви
                    реєструєтеся як Продавець у Сервісі, ми збираємо інформацію про вас, як-от ваше ім’я та
                    прізвище, адресу електронної пошти, номер телефону, поштову адресу, дані з сертифіката
                    поводження із харчовими продуктами, демографічні дані, облікові дані облікового запису,
                    фінансова інформація та інша інформація передбачена Умовами користування. Ми
                    використовуємо цю інформацію для створення та адміністрування вашого облікового запису
                    Chef, а також для полегшення зв’язку між вами та особами, які купують у вас їжу через Сервіс.

                </p>
                <p>
                    Файли cookie: ми використовуємо файли cookie для роботи та адміністрування нашого Сайту,
                    збору інформації про використання нашого Сайту, підтримки функцій безпеки, виведення
                    реклами з Сервісу та покращення роботи з ним. «Cookie» — це частина інформації, яку
                    веб-сайт, який ви відвідуєте, надсилає у ваш браузер. Файли cookie можуть зберігатися на
                    вашому комп’ютері протягом різного часу. Термін дії деяких файлів cookie закінчується через
                    певний проміжок часу або після виходу з системи (сеансові файли cookie), інші зберігаються
                    після закриття браузера до визначеної дати закінчення терміну дії, встановленої у файлі cookie
                    (що визначається стороною, яка його розмістила), і допомагають розпізнавати ваш комп’ютер.
                    коли ви відкриваєте свій браузер і знову переглядаєте Інтернет (постійні файли cookie).

                </p>
                <p>
                    Пікселі: ми використовуємо пікселі (також відомі як веб-маяки), які є кодом, вбудованим у
                    веб-сайт, відео, електронну пошту чи рекламу, щоб надсилати інформацію про використання
                    вами Сервісу на сервер. Існують різні типи пікселів, включаючи пікселі зображень (які є
                    невеликими графічними зображеннями) і пікселі JavaScript (які містять код JavaScript). Коли ви
                    переходите на веб-сайт, відео, електронну пошту чи рекламу, які містять піксель, піксель може
                    дозволити нам скинути або зчитувати файли cookie у вашому браузері. Пікселі
                    використовуються разом із файлами cookie для відстеження активності певного браузера на
                    певному пристрої. Ми можемо включати пікселі від окремих організацій, зокрема Facebook, які
                    дозволяють нам відстежувати наші конверсії, виводити вашу рекламу за межі Сервісу
                    (наприклад, зв’язуючи адресу електронної пошти з браузером або пристроєм, що
                    використовується для доступу до Сервісу), і надавати вам з додатковими функціями, такими як
                    можливість підключити наш Сервіс до вашого облікового запису в соціальних мережах.

                </p>
                <p>
                    Аналітика: ми використовуємо аналітичні служби, такі як Google Analytics, служба
                    веб-аналітики, яку надає Google, Inc. («Google»). Ці служби аналітики використовують файли
                    cookie, щоб допомогти нам проаналізувати, як користувачі використовують Сайт, і покращити
                    ваш досвід використання Сайту. Щоб дізнатися більше про те, як Google використовує ці дані,
                    перейдіть на сторінку www.google.com/policies/privacy/partners/.

                </p>
                <p>
                    Онлайн-відстеження та сигнали «Не відстежувати». Ми та наші постачальники аналітики та
                    реклами, включаючи Facebook, можемо використовувати файли cookie, пікселі або інші
                    технології відстеження, щоб збирати інформацію про вашу діяльність у веб-переглядачі
                    протягом певного часу та на різних веб-сайтах після використання вами Сайту та
                    використовувати їх інформацію для надсилання цільової реклами. Наприклад, ми розміщуємо
                    рекламу через Google і Facebook, яку ви можете переглядати, а також на інших веб-сайтах і в
                    службах
                </p>
                <p>
                    Ми також використовуємо служби зіставлення аудиторії (що є різновидом цільової реклами),
                    щоб охопити людей (або людей, схожих на людей), які відвідували наш Сервіс або
                    ідентифіковані в одній чи кількох наших базах даних («Відповідна реклама»). Для цього ми
                    надаємо рекламному партнеру список хешованих електронних адрес або додаємо піксель від
                    рекламного партнера до нашого власного Сервісу, а рекламний партнер зіставляє загальні
                    фактори між нашими та їхніми даними. Наприклад, ми розміщуємо піксель Facebook у нашій
                    Службі та можемо надати Facebook вашу адресу електронної пошти в рамках використання
                    спеціальної аудиторії Facebook
                </p>
                <p>
                    Сторони, з якими ми працюємо, щоб надавати вам цільову рекламу, можуть діяти як наші
                    постачальники послуг або, у певних контекстах, самостійно вирішувати, як обробляти вашу
                    інформацію. Ми рекомендуємо вам ознайомитися з їх політикою конфіденційності та умовами
                    використання.

                </p>

                <h2>2. ЯК МИ ВИКОРИСТОВУЄМО ІНФОРМАЦІЮ</h2>
                <p>
                    Ми збираємо та використовуємо інформацію для ділових і комерційних цілей відповідно до
                    практики, описаної в цій Політиці конфіденційності. Ми використовуємо зібрану інформацію
                    для наступних комерційних цілей:
                </p>
                <p>
                    • Для надання Сервісу, включно з онлайн-ринком, на якому Продавці можуть продавати
                    клієнтам готові харчові продукти та/або напівфабрикати (кожне – «Їжа»), а клієнти можуть
                    оцінювати та залишати відгуки про ті страви;

                </p>
                <p>
                    • Відповідати на ваші запити, коментарі, відгуки чи запитання;
                </p>
                <p>
                    • Для полегшення ваших замовлень у Сервісі;
                </p>
                <p>
                    • Щоб надіслати вам адміністративну інформацію, наприклад інформацію про Сервіс, запити на
                    відгуки та зміни наших положень, умов і політики;
                </p>
                <p>
                    • Для аналізу того, як ви взаємодієте з нашим Сервісом;
                </p>
                <p>
                    • Підтримувати та вдосконалювати вміст і функціональність Сервісу та інших веб-сайтів,
                    програм, маркетингових заходів, продуктів і послуг Chef;
                </p>
                <p>
                    • Розробляти нові продукти та послуги;
                </p>
                <p>
                    • Щоб запобігти шахрайству, злочинній діяльності або зловживанням нашим Сервісом,
                    порушенням наших політик і умов, а також забезпечити безпеку наших ІТ-систем, архітектури
                    та мереж;

                </p>
                <p>
                    • Для проведення рекламних акцій, включаючи перевірку вашої відповідності вимогам і, якщо
                    можливо, роздачу призів за ваші записи.
                </p>
                <p>
                    • Для дотримання юридичних зобов’язань і судового процесу та захисту наших прав,
                    конфіденційності, безпеки чи власності та/або прав наших афілійованих осіб, вас чи інших
                    третіх осіб;

                </p>
                <p>
                    • Для виконання будь-яких інших цілей за вашою вказівкою та з повідомленням вас і за вашою
                    згодою.

                </p>
                <p>
                    Зведена або деідентифікована інформація. Ми можемо збирати або деідентифікувати
                    інформацію у формі, яка не ідентифікує вас, і використовувати таку агреговану або
                    деідентифіковану інформацію для будь-яких цілей, крім випадків, заборонених законом.

                </p>
                <p>
                    Маркетинг. Ми використовуємо вашу інформацію, щоб зв’язатися з вами, щоб повідомити про
                    продукти чи послуги, які, на нашу думку, можуть вас зацікавити. Ми використовуємо пошту,
                    щоб надсилати вам спеціальні пропозиції.

                </p>


                <h2>3. ОБМІН І РОЗКРИТТЯ ІНФОРМАЦІЇ</h2>
                <p>
                    Ми надаємо ваші відомості, які збираємо відповідно до практики, описаної в цій Політиці
                    конфіденційності. Нижче наведено категорії сторін, з якими ми ділимося інформацією:

                </p>
                <p>
                    • Постачальники послуг: щоб допомогти нам задовольнити потреби ділових операцій і
                    виконувати певні послуги та функції, ми надаємо доступ до інформації постачальникам послуг,
                    включаючи постачальників послуг хостингу, хмарних служб та інших постачальників послуг
                    інформаційних технологій, програмного забезпечення для зв’язку електронною поштою та
                    послуг електронної розсилки новин, процесори платежів, служби управління
                    взаємовідносинами з клієнтами та служби підтримки клієнтів, а також служби веб-аналітики.
                    Згідно з нашими інструкціями, ці сторони матимуть доступ, оброблятимуть або зберігатимуть
                    інформацію під час виконання своїх обов’язків перед нами, хоча ми можемо дозволити їм
                    використовувати інформацію, яка не ідентифікує вашу особу (включно з інформацією, яка була
                    узагальнена або деідентифікована), з будь-якою метою, крім випадків, заборонених чинним
                    законодавством.

                </p>
                <p>
                    • Продавці: ми ділимося інформацією з продавцями в Сервісі (кожен , «Продавець»), щоб
                    полегшити ваші замовлення, надати Продавцям ваші відгуки та оцінки їхніх страв, відповісти
                    на ваші запитання, продавати та рекламувати вам, а також іншим чином виконувати вимоги
                    відповідно до чинного законодавства
                </p>
                <p>
                    • Партнери: ми ділимося інформацією з нашими партнерами у зв’язку з пропозиціями
                    брендових послуг, продажем або розповсюдженням наших продуктів або залученням до
                    спільної маркетингової діяльності.

                </p>
                <p>
                    • Рекламні акції: наші рекламні акції можуть спільно спонсоруватися або пропонуватися
                    іншими сторонами. Коли ви добровільно берете участь в акції, ми надаємо інформацію, як
                    зазначено в офіційних правилах, які регулюють акцію, а також для адміністративних цілей і
                    відповідно до вимог законодавства (наприклад, у списку переможців). Беручи участь в
                    рекламній акції, ви погоджуєтеся з офіційними правилами, які регулюють цю акцію, і можете,
                    за винятком випадків, коли це заборонено чинним законодавством, дозволити спонсору та/або
                    іншим організаціям використовувати ваше ім’я, голос і/або зовнішність у рекламі чи
                    маркетингових матеріалах.

                </p>
                <p>
                    • Профіль і відгуки: ми надаємо доступ до інформації, яку ви оприлюднили, такої як
                    інформація у вашому профілі (наприклад, зображення профілю) або ваші відгуки про
                    Продавців і страви. Будь ласка, добре подумайте, перш ніж оприлюднити інформацію, оскільки
                    ви несете повну відповідальність за будь-яку інформацію, яку ви оприлюднили. Після того, як
                    ви опублікували інформацію, ви не зможете редагувати або видаляти таку інформацію.

                </p>
                <p>
                    • Передача бізнесу: якщо ми беремо участь у злитті, поглинанні, фінансуванні належної
                    перевірки, реорганізації, банкрутстві, продажу всіх або частини наших активів або передачі
                    послуг іншому постачальнику, інформація буде передана в процесі перевірки з контрагентами
                    та іншими особами, які допомагають з транзакцією, і передано правонаступнику або
                    афілійованій особі в рамках такої операції разом з іншими активами.

                </p>
                <p>
                    • Безпека та юридичні вимоги: ми надаємо інформацію, яку збираємо, якщо цього вимагає
                    закон або якщо ми сумлінно переконані, що такі дії необхідні для (1) виконання юридичних
                    зобов’язань, у тому числі для виконання вимог національної безпеки чи правоохоронних
                    органів , (2) захищати наші права чи власність, (3) запобігати шахрайству, (4) діяти в екстрених
                    випадках для захисту прав, власності, життя, здоров’я, загальної безпеки та нашої власної
                    безпеки, Сервісу, користувачів, або (5) захисту від юридичної відповідальності.
                </p>
                <p>
                    • Афілійовані особи: ми можемо ділитися інформацією з нашими афілійованими особами,
                    тобто юридичною особою, яка контролює, контролюється або перебуває під спільним
                    контролем Chef. Наші афілійовані особи можуть використовувати інформацію, якою ми
                    ділимося, відповідно до цієї Політики конфіденційності, зокрема, коли вони діють як наші
                    постачальники послуг або для власних внутрішніх цілей.

                </p>
                <p>
                    • Згода: ми ділимося інформацією відповідно до вашої згоди.
                </p>
                <p>
                    Незважаючи на зазначене вище, ми можемо надавати інформацію, яка не ідентифікує вас
                    (включаючи інформацію, яка була зведена або деідентифікована), за винятком випадків,
                    заборонених чинним законодавством.

                </p>

                <h2>4. ЗБЕРІГАННЯ ТА ВИДАЛЕННЯ ДАНИХ</h2>
                <p>
                    Ми зберігаємо інформацію до тих пір, поки це обґрунтовано необхідно для цілей, описаних у
                    цій Політиці конфіденційності, поки у нас є ділова потреба в цьому або відповідно до вимог
                    законодавства (наприклад, для податкових, юридичних, бухгалтерських чи інших цілей ),
                    залежно від того, який період часу є довшим.
                </p>
                <p>
                    За вашим запитом ми вживемо заходів для видалення інформації, яку ми зібрали від вас, проте
                    ми можемо зберігати інформацію, яку ми маємо юридичне зобов’язання або ділову потребу
                    зберігати до тих пір, поки це обґрунтовано необхідно. Ви можете подати запит на видалення
                    вашої інформації, надіславши нам електронний лист на homechef.reply@gmail.com.

                </p>


                <h2>5. ОНОВИТИ СВОЮ ІНФОРМАЦІЮ</h2>
                
                <p>
                    Будь ласка, увійдіть до свого облікового запису або зв’яжіться з нами за адресою
                    homechef.reply@gmail.com, якщо Вам потрібно змінити, видалити чи виправити свою
                    інформацію. Будь ласка, зверніть увагу, що ми будемо зберігати та використовувати інформацію
                    про вас у міру необхідності для дотримання наших юридичних зобов’язань, вирішення
                    суперечок і забезпечення виконання наших угод.

                </p>


                <h2>6. ДІТИ</h2>
                <p>
                    Наш сервіс не орієнтований на дітей і розрахований на широку аудиторію. Chef свідомо не
                    збирає особисту інформацію від дітей. Якщо ви є батьком або опікуном і маєте підстави
                    вважати, що ваша дитина надала інформацію Chef через Сервіс, зв’яжіться з нами за адресою
                    homechef.reply@gmail.com, і ми докладемо зусиль, щоб видалити цю інформацію з наших баз
                    даних.

                </p>

                <h2>7. ПОСИЛАННЯ НА ІНШІ ВЕБ-САЙТИ</h2>
                <p>
                    Сервіс може містити посилання на інші веб-сайти, якими не керує або які не контролює Сhef,
                    включаючи служби соціальних мереж. Інформація, якою ви ділитеся та яку збирають інші
                    сторони, регулюватиметься конкретною політикою конфіденційності та умовами надання
                    послуг іншої сторони, а не цією Політикою конфіденційності. Надаючи ці посилання, не
                    означає, що ми підтримуємо або перевіряємо ці сайти. Будь ласка, зв’яжіться безпосередньо з
                    іншою стороною, щоб отримати інформацію про її політику конфіденційності.

                </p>

                <h2>8. БЕЗПЕКА</h2>
                <p>
                    Ви використовуєте Сервіс на власний ризик. Ми впроваджуємо та підтримуємо комерційно
                    обґрунтовані технічні, адміністративні та організаційні заходи для захисту інформації про вас
                    як онлайн, так і офлайн від втрати, неправильного використання та несанкціонованого доступу,
                    розкриття, зміни чи знищення. Проте жодна передача через Інтернет чи електронну пошту не є
                    повністю безпечною чи безпомилковою. Зокрема, електронна пошта, надіслана нам або від нас,
                    може бути незахищеною. Тому вам слід особливо уважно вирішувати, яку інформацію ви
                    надсилаєте нам через Сервіс або електронну пошту. Будь ласка, майте це на увазі, розкриваючи
                    будь-яку інформацію Chef через Інтернет.

                </p>
                <p>
                    Також, важливим є те, що ми надаємо лише простір для взаємодії між зацікавленими
                    сторонами та не несемо персональної відповідальності за кінцеву послугу, яка надається
                    продавцем клієнту. Разом з тим, зі свого боку ми робимо все можливе для того, щоб убезпечити
                    клієнта через максимально можливу перевірку продавця
                </p>

                <h2>9. ОПЛАТА</h2>
                <p>
                    Послуги, які надає наш Сервіс є безкоштовними для клієнтів, тобто особа, яка виконує
                    замовлення готової харчової продукції та/або напівфабрикатів у продавця не сплачує жодних
                    коштів за користування Сервісом. Продавці, при користуванні нашим Сайтом, тобто
                    розміщуючи свої пропозиції на Сайті, повинні сплачувати певну суму, як таку, що покриває
                    базові потреби функціонування Сайту.

                </p>
                <p>
                    В такому випадку ми надаємо продавцю простір для просування себе, як особи, яка буде мати
                    змогу заробити грошові кошти за виконання замовлень для клієнта.

                </p>
                <p>
                    Клієнт сплачує кошти за замовлення на пряму продавцю, наш Сервіс не приймає платежів та не
                    перераховує їх
                </p>
                <p>
                    Для користування нашим Сайтом продавцю необхідно сплачувати кошти на розрахунковий
                    рахунок нашої компанії із маркування платежа (id користувача) для безпомилкового
                    зарахування і подальшого функціонування особистого кабінету. У пільговий період сплачувати
                    кошти за користування Сервісом не потрібно.
                </p>
                <p>
                    Також можлива інша форма співпраці, при якій сервіс буде стягувати певний відсоток з
                    платежу Клієнта на користь платформи, але при цьому не потрібно сплачувати за користування
                    особистим кабінетом.

                </p>

                <h2>10. ЗМІНИ В ПОЛІТИЦІ КОНФІДЕНЦІЙНОСТІ</h2>
                <p>
                    Ми можемо оновити цю Політику конфіденційності в будь-який час. Коли ми це зробимо, ми
                    опублікуємо оновлену версію на цій сторінці, якщо інше повідомлення не вимагається
                    відповідним законодавством. Продовжуючи використовувати наш Сервіс ви погоджуєтеся з
                    опублікованою на той час Політикою конфіденційності та практикою, описаною в ній
                </p>

                <h2>11. ЗВ’ЯЖІТЬСЯ З НАМИ</h2>
                <p>
                    Якщо у вас виникли запитання щодо нашої Політики конфіденційності або способів надання
                    інформації, будь ласка, зв’яжіться з нами за адресою homechef.reply@gmail.com.
                </p>
                <p>
                    Ми можемо вимагати від вас певну інформацію, щоб допомогти нам підтвердити вашу особу та
                    обробити ваш запит. Якщо ми не зможемо підтвердити вашу особу, ми можемо відхилити ваш
                    запит.
                </p>
            </div>
        </div>
    )
}

export default PrivatePolicy