
import productSafetyImage from '../assets/productsSafetyImage.png'
import './footerPages.css'
const ProductsSafety = () => {

   
    return( 
        <div className='prod-safety__container'>
            <div className='prod-safety__content'>
                
                <div className='prod-safety__txt'>
                    <div className='prod-safety__img'>
                        <img src={productSafetyImage}></img>
                    </div>
                    <h1>Безпечність продуктів</h1>
                    <div>
                        <p>
                            Домашні кухарі відіграють важливу роль у забезпеченні безпеки продуктів харчування. 
                            Дотримання певних норм і правил може значно знизити ризик харчових отруєнь і зберегти здоров'я родини
                        </p>
                        <p>
                            По-перше, необхідно звертати увагу на гігієну рук. Перед приготуванням їжі та після роботи з сирими продуктами (м'ясо, риба, яйця) руки слід ретельно мити з милом, щоб запобігти поширенню бактерій. Також важливо підтримувати чистоту кухонних поверхонь: регулярно прибирати та дезінфікувати робочі місця, кухонні приналежності та посуд. 
                            Рекомендується використовувати окремі дошки для м'яса та овочів, щоб уникнути перехресного забруднення.
                        </p>
                        <p>
                            Правильне зберігання продуктів також грає ключову роль. 
                            Слідкуйте за температурою в холодильнику (не вище 4°C) і морозильній камері (не вище -18°C), 
                            а продукти зберігайте в герметичних контейнерах, щоб запобігти їх псуванню та забрудненню. Не забувайте перевіряти терміни придатності на упаковках і уникати використання прострочених продуктів, особливо молочних виробів, м'яса та риби.
                        </p>
                        <p>
                            Термічна обробка — ще один важливий аспект безпеки. Переконайтеся, що м'ясо та риба готуються до безпечної температури (наприклад, курка — до 75°C). Для перевірки готовності використовуйте термометр. При розморожуванні продуктів дотримуйтеся правил: використовуйте холодильник, холодну воду або 
                            мікрохвильову піч, але не залишайте продукти при кімнатній температурі, щоб уникнути розмноження бактерій.
                        </p>
                        <p>
                            Нарешті, освіта та обізнаність домашніх кухарів про безпечні методи приготування їжі та актуальні 
                            санітарні норми мають велике значення. Це можна досягти через курси або онлайн-ресурси.
                        </p>
                        <p style={{fontWeight: '600'}}>
                            Дотримання норм безпеки продуктів — це не тільки обов'язок професіоналів, але й важливе завдання для всіх домашніх кухарів. Ми пишаємося, що в нашій команді працюють 
                            люди із розумінням своєї важливості на всіх етапах, із розуміння відповідальності перед іншими.
                        </p>
                    </div>
                </div>

            </div>
        </div>
    )
}

export default ProductsSafety