
import { useEffect } from 'react'
import './TermOfUse.css'
const TermOfUse = () => {
    useEffect(() => {
            window.scrollTo(0, 0)
          }, [])
    return (
        <div className="terms">
            <h1>УГОДА КОРИСТУВАЧА ПРО КОРИСТУВАННЯ САЙТОМ <br/> HOMECHEF </h1>
            <div className="terms__content" inert>
            <h2>1. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h2>
                <p>
                1.1. Дана угода про користування сайтом Home Chef (далі за текстом - Угода) визначає
                умови використання сайту Home Chef (далі за текстом - Сайт), розміщеного на сторінці за
                адресою: http://homechef.com.ua Контроль за функціонуванням та роботою, обслуговуванням
                сайту здійснює Адміністрація Сайту.
                </p>
                <p>
                1.2. Користувач, у разі здійснення дій по використанню Сайту, підтверджує, що він
                ознайомився і погоджується з положеннями цієї Угоди. У разі незгоди з положеннями цієї Угоди,
                використання Сайту користувачем повинно бути припинене.
                </p>
                <p>
                1.3. Адміністрація Сайту надає Користувачу доступ до функціоналу Сайту, що забезпечує
                можливість ознайомитися з послугами, які розміщені на Сайті (далі за текстом - Компанія), а
                також можливість придбати готову харчову продукцію, яка цікавить Користувача на обрану
                Користувачем дату. Під придбанням тут мається на увазі сукупність дій Користувача на
                сторінках Сайту, в результаті яких Користувач оформляє замовлення на обрані харчові продукти
                продавця або продавців на відповідну дату та час шляхом використання Сайту та здійснює
                оплату послуг на пряму продавцю та/або за допомогою платіжних сервісів Сайту. Продавець
                приймає оплату та виконує замовлення.
                </p>
                <p>
                1.4. Всі послуги, які доступні на даний час на Сайті та всі інші, які з’являться в
                подальшому є предметом даної Угоди.
                </p>
                <p>                
                1.5. При використанні Сайту Користувач зобов’язаний діяти сумлінно та використовувати
                функціонал Сайту тільки в рамках вказаної угоди, не порушувати права Адміністрації Сайту,
                продавців, які надають послуги, інших користувачів та третіх осіб.
                </p>
                <p>
                1.6. Користувач не має права використовувати Сайт, якщо він не має дійсної мети
                скористатися послугою замовлення готових харчових продуктів та/або напівфабрикатів. Дії, що
                вчинені без наміру реального користування запропонованими послугами будуть розцінені
                грубим порушенням вказаної Угоди, а для недобросовісного Користувача будуть застосовані
                наслідки, визначені вказаною Угодою.
                </p>
                <p>
                1.7. Платформа Home Chef не несе відповідальності за послуги, які надаються продавцями
                покупцям. Вся відповідальність за стан, якість, виконання та/або не виконання замовлення
                лежить на Продавці.
                </p>
                <p>
                1.8. Терміни та визначення, що вживаються в Угоді
                Сайт – веб-сайт, розміщений за електронною адресою в мережі інтернет: http://homechef.com.ua і
                представлений у вигляді сукупності інформації та програм, що об’єднані єдиною метою та в одній
                інформаційній системі.
                Адміністрація сайту – відповідальні особи та інші пов’язані особи, залучені на договірних умовах, які
                відповідальні за роботу Сайту, обробку, збирання та опрацювання інформації користувачів.
                Користувач – фізична та/або юридична особа, фізична особа підприємець, що має повну цивільну
                дієздатність для приєднання до Угоди про користування Сервісом на умовах, визначених даною Угодою.
                Кожен Продавець є користувачем, але не кожен Користувач є Продавцем.
                Продавець – фізична та/або юридична особа, фізична особа підприємець, яка здійснює діяльність по
                виготовленню страв та/або напівфабрикатів на замовлення з подальшим розміщенням відповідної
                інформації на Сайті..
                Покупець – фізична особа, яка замовляє страви та/або напівфабрикати у продавця та сплачує кошти за
                надану послугу. Важливо, що Користувач має відповідний статус після реєстрації на Сайті. Даний статус
                ніяким чином не змінює статус Покупця (не перестає бути Користувачем), але розширює можливості по
                взаємодії із Сайтом шляхом створення особистого кабінету.
                Сервіс – розділ Сайту, направлений на надання визначених послуг розміщення замовлень та їх придбання.
                Компанії – юридичні особи, незалежно від форм власності, фізичні особи-підприємці, приватні
                підприємства, що надають послуги з виготовлення та реалізації харчової продукції.
                Контент – інформаційне наповнення Сайту, в тому числі елементи дизайну Сайту, зображення, фото- та
                відеоматеріали, текст, товарні знаки, а також інші об’єкти та результати інтелектуальної діяльності.
                Особистий кабінет – розділ Сайту, в якому міститься особиста інформація Користувача, яку він може
                редагувати та виконувати інші дії у даному розділі для комфортного користування Сайтом та Сервісом.
                Особистий кабінет зʼявляється після реєстрації користувача та обрання певної ролі для взаємодії із Сайтом.
                </p>
                <h2>2. УМОВИ УКЛАДЕННЯ ДОГОВОРУ</h2>
                <p>
                2.1. Дана Угода є публічним договором, і регулює умови користування Сервісом і Сайтом , а
                також права та обов’язки його Адміністрації та Користувачів.
                </p>
                <p>
                2.2. Ця угода є укладеною та дійсною з моменту замовлення Користувачем послуг на Сайті.
                Всі дійсні на момент укладення Угоди Сервіси, а також ті, які будуть створені та інтегровані на
                Сайт в майбутньому є предметом даної угоди.
                </p>
                <p>
                2.3. До завершення замовлення послуг Продавців на Сайті або до початку замовлення послуг
                Користувач зобов’язується ознайомитися з умовами вказаної Угоди та іншими документами,
                розміщеними на сайті. Здійснення замовлення та/або розміщення такого замовлення на Сайті
                Користувачем, здійснення інших дій по використанню функціоналу Сайту підтверджують повне
                ознайомлення Користувача з Умовами вказаної Угоди та іншими документами, що розміщені на
                Сайті, повне і безумовне їх прийняття.
                </p>
                <p>
                2.4. Адміністрація Сервісу має право вносити зміни до вказаної Угоди без попереднього
                узгодження змін із Користувачами. Нова редакція Угоди набирає чинності з моменту її розміщення
                на Сайті, якщо інше не передбачено умовами Угоди. Якщо після набрання чинності новою
                редакцією Угоди Користувач продовжує користуватися Сервісами Сайту, такими діями він виражає
                свою згоду з новою редакцією Угоди та підтверджує ознайомлення з новою редакцією. Якщо
                користувач не згоден з умовами нової редакції Угоди він повинен припинити користування Сайтом.
                </p>
                <p>
                2.5. Користувач зобов’язаний самостійно слідкувати за внесенням змін до умов Угоди. Крім
                того Адміністрація Сайту може направляти повідомлення засобами сайту Користувачам.
                </p>
                <p>
                2.6. Послуги по використанню Сайта надаються Покупцям безкоштовно. Плата встановлена
                лише для Продавців після спливу пільгового періоду. Покупець сплачує за замовлення страв та/або
                напівфабрикатів, які розміщуються Продавцем на пряму Продавцю без приймання участі
                технічних рішень на Сайті.
                </p>
                <p>
                2.7. Вказана Угода не допускає використання Користувачами або іншими третіми особами
                фірмових назв юридичних осіб, що входять до Адміністрації Сервісу, товарних знаків, доменних
                імен, зображень, фото- та відеозаписів розміщених на сайті, а також загального стилю оформлення
                Сайту, без попереднього погодження з Адміністрацією Сайту.
                </p>
                <p>
                2.8. Для користування послугами, що надаються Сайтом та Сервісами необхідно мати
                комп’ютер або інший пристрій, який дозволяє отримати доступ до мережі Інтернет (телефон,
                планшет тощо).
                </p>
                <h2>3. УМОВИ КОРИСТУВАННЯ САЙТОМ</h2>
                <p>
                3.1. Процедура замовлення здійснюється Користувачем через обрання страви, яка через
                внутрішні переконання привернула увагу, підтвердження такого замовлення шляхом комунікації
                із Продавцем і подальшою оплатою замовлення. Ця інформація є конфіденційною та не підлягає
                розголошенню, за виключенням випадків, встановлених чинним законодавством та цією
                Угодою.
                </p>
                <p>
                3.2. Процедура розміщення замовлення здійснюється через заповнення необхідної форми з
                подальшою обробкою зазначеної у формі інформації Адміністрацією Сайту. Розміщувати
                замовлення можуть ті Користувачі, які попередньо зареєструвалися на Сайті та мають статус
                Продавця.
                </p>
                <p>
                3.3. При проходженні процедури реєстрації Користувач зобов’язується надавати лише
                достовірну та повну інформацію щодо себе, а також підтримувати вказану інформацію в
                актуальному стані. У випадку надання недостовірної інформації Адміністрація Сервісу має
                право заблокувати облікові дані Користувача, вказані під час реєстрації та відмовитися від
                подальшого надання послуг через Сервіси Сайту цьому Користувачу.
                </p>
                <p>
                3.4. Персональна та конфіденційна інформація, яка вказується користувачем при
                оформленні замовлення та/або його розміщенні, обробляється Адміністрацією Сервісу з метою
                виконання вимог вказаної Угоди та на умовах Положення про Конфіденційність, що визначають
                умови користування Сервісом. Користувач підтверджує, що ознайомлений з Положенням про
                Конфіденційність, а також надає згоду на обробку вказаної інформації.
                </p>
                <h2>4. ПРАВА ТА ОБОВ’ЯЗКИ КОРИСТУВАЧА</h2>
                <p>
                4.1. Користувач не має права:
                </p>
                <p>
                4.1.1. Видавати себе за іншу особу, або за представника будь-якої організації
                {'('}підприємства{')'} або іншої особи, не маючи на це законних і достатніх підстав.
                </p>
                <p>
                4.1.2. Використовувати Сайт для порушення прав третіх осіб.
                </p>
                <p>
                4.1.3. Збирати, зберігати або передавати персональну інформацію інших Користувачів, не
                маючи на це законних підстав.
                </p>
                <p>
                4.1.4. Вчиняти дії, направлені на підривання репутації Сайту та/або Сервісів Сайту, а також
                вчиняти дії, направлені на спричинення шкоди та збитків діловій репутації юридичних осіб,
                пов’язаних з адміністрацією Сервісу та Компаній, послуги розміщуються на Сайті.
                </p>
                <p>
                4.1.5. Порушувати вимоги чинного законодавства України і положення вказаної Угоди, а
                також документів, що регламентують відносини між Користувачем та Сайтом.
                </p>
                <p>
                4.2. Користувач зобов’язаний:
                </p>
                <p>
                4.2.1. Не використовувати послуги Сайту для перепродажу або безоплатного передавання
                послуг третім особам, в тому числі автоматично сканувати, зчитувати та/або будь-яким чином
                опрацьовувати сторінки Сайту.
                </p>
                <p>
                4.2.2. Не вчиняти дії з метою зміни налаштувань устаткування та програмного
                забезпечення Сервісів Сайту та інші дії, які можуть спричинити неполадки в їх роботі.
                </p>
                <p>
                4.2.3. Не вчиняти спроби несанкціонованого доступу к Сервісам, проведення та участі в
                мережевих атаках та мережевому зламі.
                </p>
                <p>
                4.2.4. Надавати послуги із дотримання чинного законодавства без завдавання шкоди
                здоровʼю іншим Користувачам.
                </p>
                <p>
                4.3. Користувачу забороняється:
                </p>
                <p>
                4.3.1. Використовувати конфіденційну інформацію інших користувачів для отримання
                доступу до Сайту, для збору та поширення інформації, яка вказується користувачами під час
                замовлення послуг.
                </p>
                <p>
                4.3.2. Завантажувати, публікувати, зберігати, поширювати, а також іншим чином
                використовувати інформацію, яка:
                </p>
                <p>
                1{')'} носить шахрайський характер;
                </p>
                <p>
                2{')'} пропагує і/або сприяє розпалюванню расової, релігійної, етнічної ненависті або
                ворожнечі, а також сприяє розпалюванню ненависті або ворожнечі до будь-якої з соціальних
                груп; пропагує фашизм чи ідеологію расової переваги, або виправдовує злочини, вчинені
                фашизмом проти людства;
                </p>
                <p>
                3{')'} пропагує вчинення екстремістської та/або терористичної діяльності, а також надання
                допомоги організаціям та/або особам, що здійснюють терористичну та/або екстремістську
                діяльність;
                </p>
                <p>
                4{')'} пропагує злочинну та/або іншу заборонену законодавством України діяльність, містить
                рекомендації та/або інструкції по здійсненню такої діяльності;
                </p>
                <p>
                5{')'} пропагує вживання наркотичних або сильнодіючих засобів, а так само містить відомості,
                що описують привабливість вживання наркотичних або сильнодіючих засобів і/або рекламує
                таке вживання, а також містить вказівку на способи їх отримання;
                </p>
                <p>
                6{')'} містить відомості, які не підлягають розголошенню, без дотримання визначеного
                законом порядку, включаючи, але не обмежуючись: персональні дані користувачів або інших
                осіб, відомості про приватне життя третіх осіб, комерційну або державну таємницю і т.д.;
                </p>
                <p>
                7{')'} є непристойною, представлена у вигляді зображень або текстів, що містять сцени
                сексуального характеру за участю неповнолітніх;
                </p>
                <p>
                8{')'} містить опис засобів і способів здійснення суїциду, будь-яке підбурювання до його
                здійснення. Порушує права неповнолітніх осіб;
                </p>
                <p>
                9{')'} містить відомості, що носять образливий, наклепницький характер по відношенню до
                інших користувачів або третіх осіб, а також завдають шкоду діловій репутації юридичних осіб;
                </p>
                <p>
                10{')'} охороняється законодавством про інтелектуальну власність (в тому числі, авторським
                правом) і інші охоронювані законодавством матеріали, без отримання письмової згоди власника
                прав на об'єкт, що охороняється. У разі порушення Користувачем цього правила, тягар доведення
                наявності прав на розміщення відповідного матеріалу покладається на Користувача.
                </p>
                <p>
                4.3.3. Вчиняти дії, спрямовані на заподіяння шкоди Сайту або Сервісам Сайту, в тому
                числі: завантажувати, використовувати, поширювати або передавати будь-кому шкідливе
                програмне забезпечення, комп'ютерні коди, програми та файли, спрямовані на отримання
                доступу до Сайту, знищення або пошкодження інформації, обмеження функціональності
                комп'ютерного та іншого обладнання, за допомогою якого здійснюється доступ до мережі
                Інтернет.
                </p>
                <p>
                4.3.4. Перепродавати, дублювати, відтворювати, копіювати, а також здійснювати інші
                подібні операції з послугами Сервісів Сайту, за винятком випадків, коли такі операції дозволені
                Користувачеві самим Сайтом.
                </p>
                <p>
                4.3.5. Розміщувати інформацію, яка на особисту думку представників Сайту, є такою, що не
                відповідає цілям Сайту або з інших причин є небажаною для розміщення на Сайті.
                </p>
                <p>
                4.3.6. У разі якщо під час проведення певних дій у Користувача виникають сумніви в
                законності подібних дій, Сайт рекомендує утриматися від вчинення таких дій.
                </p>
                <p>
                4.3.7. Користувач несе особисту відповідальність за будь-які дії, що здійснюються ним на
                Сайті, а також за будь-яку інформацію, що розміщується ним на Сайті.
                </p>
                <p>
                4.3.8. Реєструючись або заповнюючи замовлення з отримання послуг на Сайті, Користувач
                висловлює свою згоду на отримання інформаційних та інших повідомлень за допомогою
                телефонних мереж, а також інформаційно-телекомунікаційних мереж (у тому числі в мережі
                Інтернет) на зазначені Користувачем номер мобільного телефону та адресу електронної пошти,
                що направленні на реалізацію умов вказаної Угоди, направленні на реалізацію оформленого
                замовлення Користувачем та інше.
                </p>
                <p>
                4.3.9. Адміністрація Сайту залишає за собою право вносити будь-які зміни в функціонал,
                оформлення Сайту, список його Сервісів, порядок надання послуг Сервісами Сайту, а також
                здійснювати інші дії по зміні Сайту.
                </p>
                <h2>5. ПРОЦЕДУРА НАДАННЯ ПОСЛУГ СЕРВІСОМ</h2>
                <p>
                5.1. Для отримання послуг Сервісу Користувачу необхідно:
                </p>
                <p>
                5.1.1. Обрати необхідний розділ Сервісу із запропонованих на сторінці Сайту {'('}пошук
                страви за назвою, індексом або адресою тощо{')'}. Після чого визначити і вибрати вподобану для
                Користувача страву та/або Продавця і перейти до оформлення замовлення. Потім заповнити
                необхідні додаткові параметри.
                </p>
                <p>
                5.1.2. Надати Адміністрації Сервісу в повному обсязі необхідну персональну інформацію {'('}
                ПІБ, номер мобільного телефону, адресу електронної пошти тощо{')'}. Користувач несе
                відповідальність за достовірність наданої персональної інформації. Обробка наданої
                персональної інформації здійснюється на умовах, зазначених в Угоді і Політиці
                конфіденційності.
                </p>
                <p>
                5.1.3. Оплатити вартість послуг Продавця або Продавців, у випадку необхідності
                попередньої оплати послуг, на умовах визначених в замовленні.
                </p>
                <p>
                5.1.3.1. Розмір попередньої оплати встановлюється Продавцями в залежності від
                дати та часу ймовірного надання послуг Користувачу та інших параметрів.
                </p>
                <p>
                5.1.3.2. Розмір попередньої оплати за замовлення послуги (послуга з приготування
                страви) Продавців складає 100 (сто) відсотків від вартості всього замовлення послуг. Вказана
                передплата здійснюється Користувачем після оформлення замовлення послуги засобами
                платіжних систем.
                </p>
                <p>
                5.1.3.3. Вказані грошові кошти сплачуються Користувачами засобами Системи
                дистанційного обслуговування, що здійснює переказ коштів у національній валюті без відкриття
                рахунків.
                </p>
                <p>
                5.2. Після попередньої оплати послуги Користувачеві може бути направлено повідомлення
                на вказану Користувачем електронну пошту з повідомленням про статус послуги, а також
                нагадування про те, що Користувачем здійснено замовлення, або іншими засобами
                інформування: месенджери, СМС, статус замовлення в особистому кабінеті. Дані повідомлення
                не є рекламними і направляються Користувачеві у зв'язку з виконанням договору, укладеного
                між Адміністрацією Сайту та Користувачем, а також в рамках Публічного договору між
                Продавцями та Користувачами. Вказаними електронними засобами повідомлень можуть
                направлятись підтвердження замовлень, які оформлені відповідними електронними
                сертифікатами або іншими електронними засобами підтвердження замовлень.
                </p>
                <p>
                5.3. Користувач має право анулювати замовлення до моменту приймання в роботу такого
                замовлення Продавцем та/або шляхом комунікації із продавцем доступними засобами.
                </p>
                <p>
                5.4. Після замовлення послуг Продавця зі сплатою таких послуг Користувачем, при
                скасуванні замовлення Продавець повертає 100% коштів Користувачу за вирахуванням комісій
                сервісів з переказу грошових коштів, у разі завчасного повідомлення про скасування
                замовлення.Також при несвоєчасному скасуванні замовлення Продавець залишає за собою право
                на компенсацію у розмірі до 50% від суми замовлення та перерахувати суму коштів, яка
                залишилася за вирахуванням комісій сервісів з переказу грошових коштів.
                </p>
                <p>
                5.5. Адміністрація сервісу відповідає тільки за послуги, що надаються Сайтом.
                Відповідальність адміністрації Сайту в процесі надання послуг Користувачу обмежується
                функцією організації та здійснення взаємодії (в тому числі інформаційно-технічної) між
                Продавцем та Користувачем з метою замовлення послуг Продавця за допомогою мережі
                Інтернет на сторінках Сайту.
                </p>
                <h2>6. ВЗАЄМОДІЯ САЙТУ З ТРЕТІМИ ОСОБАМИ</h2>
                <p>
                6.1. Сайт може містити посилання на веб-сайти третіх осіб. Користувач особисто приймає
                рішення про перехід за вказаними посиланням та електронними адресами третіх осіб.
                </p>
                <p>
                6.2. Сайт не несе відповідальності за зміст веб-сайтів третіх осіб, до яких Користувач
                отримує доступ з Сайту або через Контент інших користувачів.
                </p>
                <p>
                6.3. Сайт не несе відповідальність за працездатність сайтів третіх осіб, доступ до яких
                Користувач може отримати зі сторінок Сайту.
                </p>
                <p>
                6.4. Сайт не несе відповідальність за будь-які операції (в тому числі фінансові), які вчинені
                Користувачами на сайтах третіх осіб, посилання на які розміщені на Сайті.
                </p>
                <h2>7. ГАРАНТІЇ ТА ВІДПОВІДАЛЬНІСТЬ</h2>
                <p>
                7.1. Адміністрація Сайту гарантує, що буде вживати всі необхідні заходи щодо
                забезпечення безпеки, збереження і цілісності персональної інформації Користувача і Контенту,
                що завантажується Користувачем.
                </p>
                <p>
                7.2. Сайт не несе відповідальності за можливі перебої в роботі Сайту та його Сервісів, що
                стались не з вини адміністрації Сайту.
                </p>
                <p>
                7.3. Адміністрація Сайту не несе відповідальності за будь-яку шкоду обладнанню
                {'/'}комп’ютеру, телефону, планшету, іншому устаткуванню, з якого відбувається доступ до сайту{'/'},
                що була спричинена внаслідок протиправних дій сторонніх осіб, або внаслідок порушення
                Користувачем вказаної Угоди, або внаслідок винних дій Користувача.
                </p>
                <p>
                7.4. Адміністрація Сайту не несе відповідальності за блокування Користувача через
                порушення умов Угоди та інших документів, розміщених на Сайті, а також за не функціонування
                певних Сервісів.
                </p>
                <p>
                7.5. Адміністрація Сайту не дає гарантій, що послуги, які надаються Продавцями,
                відповідатимуть вимогам та побажанням Користувачів. Адміністрація Сайту не несе
                відповідальності за протиправні дії Продавців та/або інших Користувачів.
                </p>
                <p>
                7.6. Адміністрація Сайту вправі видалити або заблокувати активність Користувача на Сайті
                або відмовити Користувачу в доступі до Сайту до встановлення обставин порушення та
                врегулювання спорів Сайту з третіми особами у зв’язку із порушенням Користувачем вказаних
                положень.
                </p>
                <h2>8. КОНФІДЕНЦІЙНІСТЬ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ</h2>
                <p>
                8.1. Адміністрація Сайту гарантує конфіденційність персональної інформації, наданої
                Користувачем для здійснення бронювання послуг Продавців.
                </p>
                <p>
                8.2. Сайт використовує персональну інформацію, надану Користувачем при реєстрації на
                Сайті і в процесі подальшого використання функціоналу зазначеного веб-сайту, виключно для
                цілей виконання угоди, укладеної між користувачем і адміністрацією Сайту на умовах та в
                порядку, визначеному у відповідних документах.
                </p>
                <p>
                8.3. Користувачам, які не зареєстровані на Сайті, необхідно надати персональну
                інформацію в момент укладення цієї Угоди з Адміністрацією Сайту безпосередньо при
                замовленні послуг Продавців. Адміністрація Сайту обробляє наступну персональну
                інформацію фізичних осіб, не зареєстрованих на Сайті: прізвище та ім'я Користувача, номер
                телефону, інформація про дії Користувача на сторінках Сайту, інша інформація, необхідна для
                виконання умов цієї Угоди.
                </p>
                <p>
                8.4. Під час використання Сайту, Користувач дає згоду на обробку персональних даних з
                метою надання йому послуг Адміністрацією Сайту в рамках цієї Угоди, в тому числі на
                передачу персональної інформації Продавцям, у яких Користувач здійснює замовлення послуг.
                Зареєстрований Користувач може вносити зміни в інформацію, яка розміщена в особистому
                кабінеті, але не зловживати такими діями, так як вони будуть розцінені адміністрацією Сайту
                як шахрайські.
                </p>
                <p>
                8.5. Метою обробки персональних даних Користувача є надання послуг Сайтом.
                </p>
                <p>
                8.6. Персональна інформація Користувача обробляється адміністрацією Сайту з моменту
                замовлення послуги Продавця до моменту закінчення дії або припинення цієї Угоди.
                </p>
                <h2>9. ВІДПОВІДАЛЬНІСТЬ СТОРІН</h2>
                <p>
                9.1. У разі якщо Користувач допускає грубе або систематичне порушення цієї Угоди
                або інших документів, що діють на веб-сайті, Адміністрація Сайту може обмежити для нього
                функціонал Сайту на визначений Адміністрацією час. Після закінчення зазначеного часу
                Користувачеві автоматично відновлюється функціонал Сайту.
                </p>
                <p>
                9.2. Адміністрація Сайту не несе перед Користувачем відповідальність в разі повної
                або часткової непрацездатності системи і компонентів Сайту протягом будь-якого часу, а також
                при відсутності можливості доступу Користувача до функціоналу Сайту або понесення ним
                будь-яких непрямих або прямих витрат у зв'язку з даними обставинами. Всі пропозиції, акції, а
                також умови замовлення можуть бути: змінені без повідомлення Користувача, обмежені за
                часом, а також страйками і тимчасовою непрацездатністю систем замовлення та / або через
                інші зміни умов і обмежень.
                </p>
                <p>
                9.3. Адміністрація Сайту не несе відповідальність за негативні наслідки і збитки, що
                виникли в результаті подій і обставин, що знаходяться поза сферою її впливу, а також за дії
                (бездіяльність) третіх осіб.
                </p>
                <p>
                9.4. Вся інформація, розміщена на сторінках Сайту, надана Продавцями. Адміністрація
                Сайту вживає всі можливі заходи з підтримки даної інформації в актуальному вигляді, але при
                цьому адміністрація Сайту не несе відповідальність за зміст і/або за актуальність такої
                інформації, в тому числі, але не обмежуючись: інформацію про ціни, послуги,
                місцезнаходження виконання замовлень та інше.
                </p>
                <h2>10. ІНШІ УМОВИ</h2>
                <p>
                10.1. Користувачу надається можливість використання Сайту і його Сервісів на території
                України, а також на території інших країн, в яких Сайт доступний для використання за
                допомогою стандартного устаткування.
                </p>
                <p>
                10.2. До відносин між Користувачем і Адміністрацією Сайту застосовується тільки
                законодавство України, будь-які виключення з даного правила не допускаються, в тому числі,
                якщо інший порядок встановлено національним законодавством Користувача.
                </p>
                <p>
                10.3. Сторони докладатимуть всіх зусиль з метою досягнення згоди щодо спірних питань
                шляхом переговорів. У разі неможливості досягнення згоди шляхом переговорів, усі суперечки
                підлягають розгляду в судовому порядку відповідно до законодавства України.
                </p>
                <p>
                10.4. Ця Угода діє з моменту її укладання між Користувачем і Адміністрацією Сайту і до
                моменту, коли Користувач або Адміністрація Сайту розірве цю Угоду. Цю Угоду також може
                бути розірвано повністю або частково за допомогою видалення (припинення функціонування)
                Сайту або Сервісу.
                </p>
                <p>
                10.5. Недійсність окремих положень вказаної Угоди не тягне за собою визнання
                недійсною Угоди в цілому.
                </p>
                <p>
                10.6. Ця Угода та інші документи, що діють на Сайті, розміщуються українською мовою.
                Ці документи можуть бути викладені іншими мовами. У разі виникненні протиріч між
                україномовною версією і версіями документів на інших мовах пріоритет має україномовна
                версія цього видання.
                </p>
                <p>
                10.7. З огляду на те, що послугами Сайту можуть користуватися будь-які Користувачі, в
                тому числі, що знаходяться за межами України, Користувачі-громадяни іноземних держав та
                особи без громадянства зобов'язані використовувати функціонал Сайту і його Сервісів тільки в
                тому випадку, якщо вони повністю погоджуються з умовами цієї Угоди. У разі якщо
                положеннями цієї Угоди встановлено порядок, що суперечить національному законодавству
                країни Користувача, застосуванню підлягають положення цієї Угоди. Будь-які спроби
                Користувача змінити порядок застосування положень цієї Угоди визнаються зловживанням
                правом. У разі якщо Користувач не згоден з положеннями цього пункту, йому необхідно
                утриматися від використання функціоналу сайту і його Сервісів. Всі суперечки з
                Користувачами-іноземними громадянами та особами без громадянства вирішуються шляхом
                переговорів, а у разі недосягнення згоди передаються в суд за місцем знаходження
                Адміністрації Сайту.
                </p>
                <p>
                10.8. Адміністрація Сайту має право вносити зміни до Угоди без попереднього і
                подальшого повідомлення Користувача. У разі якщо після внесення змін до Угоди Користувач
                продовжує використання Сервісів, такими дії він висловлює ознайомлення та повну згоду з
                його положеннями. У разі незгоди Користувачеві необхідно негайно припинити використання
                Сервісів Сайту.
                </p>
                <p>
                10.9. Користувач підтверджує, що електронні документи та дані, отримані від нього за
                допомогою функціоналу Сайту, розглядаються Адміністрацією Сайту як юридично значимі
                документи, складені в письмовій формі і підписані Користувачем за всіма правилами
                традиційного оформлення документів в письмовій формі.
                </p>
                <p>
                10.10. Користувачеві можуть бути доступні функції оцінки та залишення відгуків за
                послугами Продавців, які були отримані Користувачем. Оцінки і відгуки розміщуються від
                імені Користувача на сайті http://homechef.com.ua і стають доступними для перегляду не
                обмеженим колом осіб. Адміністрація Сайту залишає за собою право відмовити в розміщенні
                будь-яких оцінок і/або відгуків користувачів, а також право в будь-який момент видалити
                розміщені Користувачем оцінки та відгуки на свій розсуд без вказівки причин.
                </p>
                <p>
                10.11. Всі заяви, побажання та заперечення Користувачі можуть направляти до
                Адміністрації сайту засобами електронної комунікації, розміщеними на Сайті.
                </p>
            </div>
        </div>
    )
}

export default TermOfUse